#+TITLE: Introduction to Programming - Variables and Types
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 100 - Lyon College - Spring 2025
#+SEQ_TODO: PRACTICE TODO NEXT | DONE
#+STARTUP: overview hideblocks indent entitiespretty
#+options: toc:nil num:nil ^:nil: 
#+attr_latex: :float nil
#+property: :header-args:C      :main yes :includes <stdio.h> :results output :exports both
#+property: :header-args:python :session *Python* :python python3 :results output :exports both
#+property: :header-args:R      :session *R* :results graphics output file :exports both
#+property: :header-args:C++    :main yes :includes <iostream> :results output :exports both
* Values

- The machine only knows numbers:

  1) =1= is a whole or *integer* number:

     #+begin_src C
       printf("Integer number: %i\n", 1);
     #+end_src

     #+RESULTS:
     : Integer number: 1

  2) =1.0= is a decimal or *floating-point* number.

     #+begin_src C
       printf("Floating-point number: %.1f\n", 1.0);
     #+end_src

     #+RESULTS:
     : Floating-point number: 1.0

  3) ='1'= is a character (also stored as a number).

     #+begin_src C
       printf("Character: %c\n", '1');
     #+end_src

     #+RESULTS:
     : Character: 1

* Everything is a number

- To show that characters are stored as numbers, print it as a number:

  #+begin_src C :results output
    printf("Character: %c\n", 'A');
    printf("Character: %i\n", 'A');    
  #+end_src

  #+RESULTS:
  : Character: A
  : Character: 65

- Though we'll mostly work with these three, C has many different ways
  of representing numbers.

- Which representation (for example, long or short) is the best
  depends on the problem.

- Example:

  1) Adding 1 + 1 and showing the result is =short=:

     #+begin_src C
       printf("%i + %i = %i\n", 1, 1, 1 + 1);
     #+end_src

     #+RESULTS:
     : 1 + 1 = 2

  2) Dividing Euler's number (=exp(1)= by Pi (=3.14159...=) is =long=:

     #+begin_src C
       #include <stdio.h>
       #include <math.h>
       
       printf("%.19f / %.19f = %.19f\n", exp(1), M_PI, 1E+9 / M_PI);
     #+end_src

     #+RESULTS:
     : 2.7182818284590450908 / 3.1415926535897931160 = 318309886.1837906837463378906

* PRACTICE Everything is a number

- What do you get when you get the format wrong? The results will
  surprise you.

- Print these values using the requested format in a =printf= call:

  |   | VALUE | FORMAT         | SPECIFIER |
  |---+-------+----------------+-----------|
  | 1 | =3.14=  | integer        | =%i=        |
  | 2 | =3.14=  | character      | =%c=        |
  | 3 | =3=     | floating-point | =%f=        |
  | 4 | =3=     | character      | =%c=        |
  | 5 | ='3'=   | integer        | =%i=        |
  | 6 | ='3'=   | floating-point | =%f=        |

- Solution & Explanation:

  1. *Printing a floating-point number as an integer:* The output is an
     integer representation of the bits read by =printf= - it changes
     because the mismatch between the format specifier and the value
     argument causes *undefined behavior*.

     #+begin_src C :main yes :includes <stdio.h> :results output :exports both
       printf("%i\n",3.14);
     #+end_src

     #+RESULTS:
     : 789241224

  2. *Printing a floating-point number as character*: Prints a garbage
     character (not recognized as an ASCII character).

     #+begin_src C :main yes :includes <stdio.h> :results output :exports both
       printf("%c\n",3.14);
     #+end_src

     #+RESULTS:
     : X

  3. *Printing an integer as floating-point number*: Undefined behavior
     again. This result could also be another value.

     #+begin_src C :results output
       printf("%f\n",3);
     #+end_src

     #+RESULTS:
     : 0.000000

  4. *Printing an integer as character*: =3= is interpreted as the
     character with the ASCII code 3.

     #+begin_src C :results output
       printf("%c\n",3.14);
     #+end_src

     #+RESULTS:
     : ˆ

  5. *Printing a character as an integer*: Results in printing the ASCII
     code of the character.

     #+begin_src C :results output
       printf("%i\n",'3');
     #+end_src

     #+RESULTS:
     : 51

  6. *Printing a character as a floating-point number*: Undefined
     behavior.

     #+begin_src C :results output
       printf("%f\n",'3');
     #+end_src

     #+RESULTS:
     : 0.000000

* PRACTICE Print challenge

- Print =3.14 - 3 = .14= using =printf= and the values =3.14=, =3=, and =.14=

- Use both the format and the value part of the =printf= function.

#+begin_src C :results output
  printf("%f - %i = %f\n", 3.14, 3, .14);
  printf("%.2f - %i = %.2f\n", 3.14, 3, .14);
#+end_src

#+RESULTS:
: 3.140000 - 3 = 0.140000
: 3.14 - 3 = 0.14

